const lives = [
  {
    id: 1,
    channel: "YTN",
    name: "뉴스UP",
    rate: 25.1,
    free: true,
  },
  {
    id: 2,
    channel: "연합뉴스 TV",
    name: "라이브 투데이 2부",
    rate: 7.4,
    free: true,
  },
  {
    id: 3,
    channel: "채널A NEWS",
    name: "김진의 돌직구쇼",
    rate: 6.5,
    free: true,
  },
  {
    id: 4,
    channel: "매일경제TV",
    name: "증시 오늘 606화",
    rate: 3.2,
    free: true,
  },
  {
    id: 5,
    channel: "MBC 뉴스",
    name: "MBC 뉴스",
    rate: 3,
    free: true,
  },
  {
    id: 6,
    channel: "한국경제TV",
    name: "출발 증시 1부",
    rate: 2.8,
    free: true,
  },
  {
    id: 7,
    channel: "SBS NO.1 뉴스라이브",
    name: "[비디오머그] 체육계 병역특례",
    rate: 2,
    free: true,
  },
  {
    id: 8,
    channel: "KBS NEWS 24",
    name: "KBS 뉴스광장(재방송)",
    rate: 2,
    free: true,
  },
  {
    id: 9,
    channel: "머니투데이방송",
    name: "출발! 성공투자",
    rate: 1.7,
    free: true,
  },
  {
    id: 10,
    channel: "TV CHOSUN NEWS24",
    name: "신통방통",
    rate: 1.1,
    free: true,
  },
  {
    id: 11,
    channel: "JTBC news NOW",
    name: "JTBC news NOW",
    rate: 0.9,
    free: false,
  },
  {
    id: 12,
    channel: "MBN NEWS",
    name: "뉴스7",
    rate: 0.3,
    free: true,
  },
  {
    id: 13,
    channel: "MBC 라디오 시사",
    name: "손에 잡히는 경제 하이라이트",
    rate: 0.3,
    free: true,
  },
  {
    id: 14,
    channel: "JTBC news 아카이브",
    name: "JTBC news 아카이브",
    rate: 0,
    free: false,
  },
];

const shorts = [
  `"수입차 결함 항의"‥허리띠 풀어 '채찍질'`,
  `4차례나 신고했는데‥피해자 말만 듣고 종결`,
  `"흉기 위협 반복"‥스마트워치 꺼진 줄도 몰라`,
  `다음 달 수능 비상‥"안경 낀 수험생 전수조사"`,
  `사우디, 후티 반군 연료·군사시설에 대대적 보복 공습 `,
  `한미 정상 골프회동…靑, 준비 실무팀 가동 `,
  `"의자 던지며 막았죠"‥흉기 제압한 시민들`,
  `중국 반도체 공습에 휘청‥코스피 5% 급락`,
  `오늘 김지용 인사청문회‥당내 충돌 불가피`,
  `외교·통일·국방부도 세종으로‥1만 명 '대이동'`,
  `백악관 "한국, 알래스카 540억 달러 투자" 또 언급`,
  `인기 게임 원작 '스트리트 파이터' 개봉..섬세한 재현 #shorts`,
  `교황, 수술 뒤 '폐암' 진단…바티칸 "합병증 없이 회복 중"`,
  `"제 대통령은..아니 제 남편" 백악관 대변인 시작부터 '혹평' `,
  `유세장서 시위자 머리 잡고 폭행…트럼프 "뚱뚱해!" 조롱`,
  `양 손에 흉기 묶고 '난동'‥이르면 오늘 구속영장`,
  `에일리, 14년 만에 새로운 도전..'에일리 밴드' 결성 #shorts`,
  `[손석희의 12시] 주문 후 두 달 기다려야 하는 노벨문학상 수상자의 책?`,
  `[손석희의 12시] 전소된 400년 역사의 파리 앙팡 루즈 시장`,
];

const sports = [
  [`[LG vs KIA] 2026/10/12 하이라이트`, "21:57"],
  [
    `[아이러브 베이스볼] 2026/10/12 KIA 김도영 - 준PO 직행 이끈 슈퍼스타의 한 방`,
    "01:56",
  ],
  [`[LG vs KIA] 2026/10/12 다시보기`, "2:21:40"],
  [
    `[베이스볼 투나잇] 2026/10/12 '라이트한 사운드' KIA만을 위해 쏘아 올린 김도영의 100호 홈런`,
    "00:42",
  ],
  [
    `[베이스볼 투나잇] 2026/10/12 '17년 만의 타이거즈 홈런왕' 김도영 인터뷰`,
    "04:40",
  ],
  [`[정관장 vs 소노] 10/13 2026-27 KBL 하이라이트`, "17:50"],
  [`[롯데 vs 두산] 2026/10/12 하이라이트`, "15:09"],
  [`[LG vs KIA] 2026/10/12 티빙슈퍼매치 다시보기`, "2:42:44"],
  [`[베이스볼 투나잇] 2026/10/12 '시즌 19호 홈런' 박재현 인터뷰`, "03:49"],
  [
    `[베이스볼 투나잇] 2026/10/12 3위 확정 후 팬들에게 인사를 전하는 KIA 선수단`,
    "03:27",
  ],
  [`[KIA] 2026/10/12 박재현 주요장면`, "04:16"],
  [`[롯데 vs 두산] 2026/10/12 다시보기`, "3:14:44"],
  [
    `[아이러브 베이스볼] 2026/10/12 롯데 레이예스 - '최다 안타 1위' KBO 최초 211안타 신기록`,
    "03:21",
  ],
  [`[정관장] 2026/10/13  아반도 인터뷰`, "05:38"],
  [`[KIA] 2026/10/12 김도영 주요장면`, "05:46"],
  [`[KIA] 2026/10/12 티빙슈퍼매치: 김도영 인터뷰`, "04:23"],
  [`[KT vs 삼성] 2026/10/12 하이라이트`, "18:22"],
  [`[KIA] 2026/10/12 티빙슈퍼매치: 이범호 감독 인터뷰`, "04:47"],
  [`[LG vs KIA] 2026/10/12 티빙슈퍼매치 WAR밍업 다시보기`, "59:11"],
  [`[KIA] 2026/10/12 '홈런 단독 1위' 김도영의 투런포! (통산 100홈런)`, "02:46"],
];

const channel_news = [
  [
    [
      `YTN`,
      "후티 미사일 왜 못 막았나 조사...이스라엘도 참전?",
      `02:11`,
      `6시간전`,
      `국제`,
      `<p>[앵커] 
        </p><p>예멘의 친이란 후티 반군과 사우디 간 무력 공방 속에 사우디는 대규모 인명 피해를 낸 후티의 공항 공격 대응에 실패한 것을 두고 조사에 착수했습니다.
        </p><p>이런 가운데 이스라엘이 후티에 대한 공습에 참전할 뜻을 내비쳐 확전 가능성도 배제할 수 없는 상황입니다.
        </p><p>런던 조수현 특파원입니다.
        </p><p>[기자] 
        </p><p>지난 10일 사우디아라비아 수도 리야드의 킹칼리드 국제공항.
        </p><p>승객들이 붐비는 보안검색대에서 갑자기 큰 폭발이 일어나며 공항은 순식간에 아수라장이 됩니다.
        </p><p>후티 반군의 공격에 14명이 숨지고 300명 넘게 다치는 참사가 발생하자, 사우디는 강경 대응을 천명했습니다.
        </p><p>[압둘아지즈 빈 살만 / 사우디 에너지 장관 : 최근 몇 주간 발생한 사태는 심각합니다. 우리의 대응도 이에 비례해야 합니다.]
        </p><p>이번 일로 방공태세의 심각성을 자각한 사우디 당국은 천km를 날아온 미사일을 왜 막지 못했는지 규명하기 위한 자체 조사를 벌이고 있습니다.
        </p><p>1차 조사 결과 후티는 드론 여러 대를 먼저 띄워 방공망을 교란한 뒤 탄도·순항 미사일을 섞어 발사한 것으로 파악됐습니다.
        </p><p>여기에 탄도미사일과 함께 비행 중 방향을 바꾸는 탄두를 단 첨단무기를 보유해 사우디의 패트리엇 방공망이 막기 어려워졌다는 분석입니다.
        </p><p>사우디 민간항공청은 최근 잇단 공습에 따라 킹칼리드 국제공항을 현지 시간 18일 0시까지 폐쇄했습니다.
        </p><p>이에 따라 여객기들은 사우디 영공을 우회하고 있고 리야드행 항공편은 제다 공항에 착륙하며 차질이 이어지고 있습니다.
        </p><p>또 미국 항공사가 운영하는 첫 사우디 직항편은 이달 23일로 예정돼 있었는데, 내년 3월로 연기됐습니다.
        </p><p>사우디와 후티의 무력 충돌이 격화하는 가운데, 이스라엘의 참전 여부도 새로운 변수로 떠올랐습니다.
        </p><p>네타냐후 이스라엘 총리가 후티에 대한 공습을 위해 사우디아라비아의 승인을 타진하고 있는 겁니다.
        </p><p>다만 결정권을 쥔 무함마드 빈살만 왕세자가 자국 내 반이스라엘 여론을 우려하고 있어, 실제 성사 가능성은 낮다는 관측입니다.
        </p><p>런던에서 YTN 조수현입니다.
        </p><p>영상편집 : 유현우
        </p><p>※ '당신의 제보가 뉴스가 됩니다'
        </p><p>[카카오톡] YTN 검색해 채널 추가
        </p><p>[전화] 02-398-8585
        </p><p>[메일] social@ytn.co.kr</p>
        `,
    ],
    [
      `YTN`,
      `추미애 "이 자리는 국정감사...정치 소신은 다음에" [현장영상+]`,
      `02:23`,
      `6시간전`,
      `정치`,
      `<p>[앵커]
        </p><p>국회 행정안전위원회가 경기도청에 대한 국정감사를 진행하고 있습니다.
        </p><p>추미애 경기지사가 김지용 초대 중수청장 후보자 인선을 비롯한 여권 현안에 대해 공개적인 반발을 이어온 만큼, 야당뿐 아니라 여당에서도 비판의 목소리가 예상되는데요.
        </p><p>현장 연결해 보겠습니다.
        </p><p>[박상웅 / 국민의힘 의원]
        </p><p>추미애 지사님, 수고 많으십니다. 지사님 취임이 100일이 지나지 않았습니까? 취임 후에 지사님 SNS에는 민생을 챙기는 보육, 청년, 저출산율과 관련되는 산후조리 등 도지사의 민생에 대한 책임과 역할을 떠올리게 하는 단어들이 잘 안 보이고 오히려 중앙 정치와 직결된 예를 들어서 김지용 중수청장 후보자의 이름 석 자, 이게 SNS에 더 빈번하게 거론되고 있다는 지적이 있습니다. 오늘 이 자리가 1400만 도민이 맡긴 경기도 살림을 내팽개치고 중앙 정치판을 기웃거린 100일이 아니었는가. 가혹하지만 이런 의문을 갖는 여론도 있습니다. 지사님 스스로 냉정하게 돌아보는 자리가 되었으면 좋겠습니다. PPT 하나 보여주시죠. 저 자료를 보면 총 80건의 내용 중에 김지용 저격하는 발언이 8건, 중앙정치와 관련된 발언이 14건, 보완수사권 폐지 등.이 이야기가 그렇게 긴급하고 중요했나 하는 의문을 갖기는 갖습니다. 내일 당장 김지용 중수청장 후보자에 대한 인사청문회가 실시될 예정인데 여전히 현재 부적격 의견에는 소신에 변화가 없죠?
        </p><p>[추미애 / 경기도지사]
        </p><p>위원님께 간곡히 양해 말씀드리겠습니다. 제가 이 자리는 국정감사를 받는 자리이기 때문에 제 개인적인 정치 소신에 대해서는 다른 기회에 말씀을 드리도록 하겠습니다. 
        </p><p>[박상웅 / 국민의힘 의원]
        </p><p>그러니까 경기도지사가 개인적인 소신으로 SNS를 통해서 여러 의견을 내지만 국감장에서는 말하기가 곤란하다, 이 뜻으로 받아들이겠습니다. PPT 하나 보시죠. 저격을 할 때 김지용 중수청장에 대해서 밀정이니...
        </p><p>※ '당신의 제보가 뉴스가 됩니다'
        </p><p>[카카오톡] YTN 검색해 채널 추가
        </p><p>[전화] 02-398-8585
        </p><p>[메일] social@ytn.co.kr</p>
        `,
    ],
    [
      `YTN`,
      `강경화 "한미 정보협력, 제일 어려운 현안...백악관 소통도 한계"`,
      `03:59`,
      `6시간전`,
      `국제`,
      `<p>[앵커] 
        </p><p>미국 워싱턴에서 열린 주미 한국대사관 국정감사에서 한미 정보협력 차질 논란이 집중적으로 제기됐습니다.
        </p><p>강경화 대사는 미국의 기대만큼 정보협력 문제가 해소되지 않았다고 인정하며, 백악관과의 고위급 소통에 한계가 있다고 밝혔습니다.
        </p><p>워싱턴 연결해 자세한 내용 알아보겠습니다. 신윤정 특파원!
        </p><p>먼저 한미 간 정보협력 논란과 관련해 어떤 이야기들이 나왔습니까?
        </p><p>[기자] 
        </p><p>강경화 대사는 한미 정보협력 문제가 현재 양국 관계에서 가장 어려운 현안 가운데 하나라고 밝혔습니다.
        </p><p>지난달 조현 외교부 장관과 마코 루비오 미 국무장관의 회담에서 미국 측이 정보협력에 문제가 있다는 입장을 전달했다고 확인했습니다.
        </p><p>그러면서 아직 미국이 기대하는 만큼 문제가 충분히 해소되지는 않았다고 말했는데요, 강 대사 발언 직접 들어보시죠.
        </p><p>[강경화 / 주미한국대사 : 정보협력에 문제가 있다는 얘기는 있었습니다. 아직 미 측이 기대하는 만큼의 정보협력 관련해서 문제가 충분히 해소되었다고는 생각은 안 합니다.]
        </p><p>다만 논란의 중심에 선 정동영 통일부 장관과 이종석 국가정보원장의 거취를 루비오 장관이 거론했는지에 대해선 "구체적 인사에 대해선 언급이 없었던 것으로 기억한다"고 말했습니다.
        </p><p>강 대사는 정 장관의 '북한 구성 핵시설' 발언 이후 정 의원으로부터 전화를 받고 미국 측에도 설명을 전달했다고 설명했는데요, 미국 측이 문제 삼은 건 정 장관 발언이지, 정 장관 개인에 대한 문제 지적은 아니었다고 덧붙였습니다.
        </p><p>강 대사는 백악관과의 소통에도 한계가 있다는 점을 시인했습니다.
        </p><p>[강경화 / 주미한국대사 : 백악관에 대한 소통에는 좀 한계가 있음을 제가 시인하겠습니다. 백악관의 NSC, 또는 주요 인사들과의 면담을 저도 자주 하지만 제가 하고 싶은 만큼의, 제가 하고 싶은 만큼 고위의 협의는 지금으로는 저도 답답한 정도로….]
        </p><p>다만 한미 정보기관 간 소통이 계속되고 있고, 일부 진전도 이뤄진 것으로 알고 있다고 설명했습니다.
        </p><p>야당 의원들은 정보공유 제한과 한국 측 인사들의 비자 문제 등을 거론하며 한미동맹의 신뢰 회복을 위한 적극적인 외교를 주문했습니다.
        </p><p>[앵커] 
        </p><p>북한의 지뢰 공격을 놓고도 논란이 있었고 북미 정상회담 가능성에 대한 전망도 나왔다고요?
        </p><p>[기자] 
        </p><p>강경화 대사는 우리 군 장병 3명이 다친 비무장지대 지뢰 폭발 사건에 대해 '불의의 사고는 분명히 아니다'라고 밝혔습니다.
        </p><p>한동훈 의원이 북한의 고의적인 공격인지 거듭 따져 묻자, 북한이 의도를 가지고 지뢰를 매설한 것이라는 합참의 조사 결과에 동의한다고 답한 겁니다.
        </p><p>[한동훈 / 무소속 의원 : 고의로 인한 공격입니까? 아니면 불의의 사고입니까?]
        </p><p>[강경화 / 주미한국대사 : 불의의 사고는 분명히 아닙니다.]
        </p><p>북미 정상회담 가능성에 대해서는 아직 구체적인 진전이나 징후가 없다고 밝혔습니다.
        </p><p>트럼프 대통령이 여러 차례 대화 의지를 표명했지만, 실제 협상으로 이어질 움직임은 확인되지 않았다는 겁니다.
        </p><p>강 대사는 북한이 한국을 대화 상대로 삼지 않겠다는 입장인 만큼, 우선 북미대화의 물꼬를 트는 것이 중요하며, 이를 남북대화로 이어가기 위해 한미 간 긴밀한 공조가 필요하다고 강조했습니다.
        </p><p>또 이재명 대통령의 북핵 동결 구상은 북한의 핵·미사일 능력 고도화를 막기 위한 실용적인 접근이라면서도, 북한 비핵화는 변함없는 정책 목표라고 밝혔습니다.
        </p><p>강 대사는 이 밖에도 한미 간 외교·통상 현안인 쿠팡 사태 처리에 대해선 미국 측에 한국의 법체계와 차별 없는 법 집행 원칙을 설명하고 있다고 밝혔습니다.
        </p><p>그러면서 쿠팡 측의 대미 로비가 강한 영향도 있을 수 있다고 언급했습니다.
        </p><p>지금까지 워싱턴에서 YTN 신윤정입니다.
        </p><p>※ '당신의 제보가 뉴스가 됩니다'
        </p><p>[카카오톡] YTN 검색해 채널 추가
        </p><p>[전화] 02-398-8585
        </p><p>[메일] social@ytn.co.kr</p>
        `,
    ],
    [
      `YTN`,
      `"미국이 오해" 정동영‥'경질론'엔 정면 반박 [앵커리포트]`,
      `02:18`,
      `6시간전`,
    ],
    [
      `YTN`,
      `"오랜 고민 끝에..." 차준환, 피겨 중단 전격 선언 [앵커리포트]`,
      `01:40`,
      `6시간전`,
    ],
    [
      `YTN`,
      `‘죽음의 롤러코스터' 에서 남성 1명 사망..."아들과 타고 있었다" [앵커리포트]`,
      `02:40`,
      `1일전`,
    ],
    [`YTN`, `'모두의 AI' 12월 출시..."어려운 게임 될 수도"`, `02:40`, `1일전`],
    [
      `YTN`,
      `신임 비서실장에 임광현 국세청장..."국민 삶 변화 만들어낼 것"`,
      `02:40`,
      `1일전`,
    ],
    [
      `YTN`,
      `'미국 표심·금리 갈림길' 물가 인상률, 5개월 만에 최고`,
      `02:40`,
      `1일전`,
    ],
    [
      `YTN`,
      `'신천지 논란'으로 또 친명-친청 갈등? [앵커리포트]`,
      `02:40`,
      `1일전`,
    ],
    [
      `YTN`,
      `[속보] 트럼프 "한국 알래스카 투자는 무역 합의 일환"`,
      `02:40`,
      `1일전`,
    ],
    [
      `YTN`,
      `'국힘 397억' 윤 항소심도 당선무효형 구형...27일 선고`,
      `02:40`,
      `1일전`,
    ],
    [
      `YTN`,
      `수에즈 막히면 북극으로...이 대통령 "북극항로 적극 지원"`,
      `02:40`,
      `1일전`,
    ],
    [`YTN`, `뱃길 열린 '북극항로'...경제성 입증이 관건`, `02:40`, `1일전`],
    [
      `YTN`,
      `김지용 인사청문회..."정치검찰은? 윤석열이 첫 번째"`,
      `02:40`,
      `1일전`,
    ],
    [`YTN`, `흉기 난동범 검거 CCTV 공개...의인 5명이 제압`, `02:40`, `1일전`],
    [`YTN`, `'공천 헌금' 강선우, 징역 2년 6개월...법정구속`, `02:40`, `1일전`],
    [`YTN`, `"어깨 부딪혀서" 주장 살해범...금품 노리고 범행`, `02:40`, `1일전`],
    [
      `YTN`,
      `[단독] "악마 보여줄게" 폭언·얼차려...휴대전화 매장 내 폭력`,
      `02:40`,
      `1일전`,
    ],
    [
      `YTN`,
      `[속보] 경찰, '구월동 흉기난동' 최 모 씨 구속영장 신청`,
      `02:40`,
      `1일전`,
    ],
    [`YTN`, `어깨 부딪혀서" 주장 살해범...금품 노리고 범행`, `02:40`, `1일전`],
    [`YTN`, `흉기 난동범 검거 CCTV 공개...의인 5명이 제압`, `02:40`, `1일전`],
    [
      `YTN`,
      `김지용 인사청문회..."정치검찰은? 윤석열이 첫 번째"`,
      `02:40`,
      `1일전`,
    ],
    [
      `YTN`,
      `'국힘 397억' 윤 항소심도 당선무효형 구형...27일 선고`,
      `02:40`,
      `1일전`,
    ],
    [
      `YTN`,
      `'하다하다 이제는'...트럼프, 호랑이 공격 영상까지 올려`,
      `02:40`,
      `1일전`,
    ],
  ],
  [
    [
      `연합뉴스TV`,
      `인천 흉기난동 본격 조사…잠시 뒤 수사 상황 설명`,
      `02:46`,
      `35분 전`,
      `사회`,
      `
        <p>[앵커]</p><p>어제 인천 구월동에서 일어난 흉기난동 사건, 피해자 1명이 여전히 의식을 되찾지 못하고 있습니다.</p><p>경찰은 잠시 뒤 오후 2시부터 기자들에게 수사 상황을 설명하는데요.</p><p>자세한 소식 취재기자 연결해 알아보겠습니다.</p><p>한웅희 기자.</p><p>[기자]</p><p>네, 인천경찰청에 나와 있습니다.</p><p>살인미수 혐의로 긴급 체포된 59살 남성 A 씨는 현재 인천 남동경찰서에서 조사를 받고 있는데요.</p><p>경찰은 잠시 뒤 오후 2시부터 기자들을 대상으로 사건과 관련한 백브리핑을 진행할 예정입니다.</p><p>백브리핑에는 인천청 형사과장과 강력계장을 비롯해 남동경찰서장과 계양경찰서장이 참여해 현재까지 수사 상황 등을 설명할 예정입니다.</p><p>A 씨에 대한 조사는 오늘 오전부터 본격적으로 진행됐는데요.</p><p>경찰은 일면식이 없는 피해자들을 대상으로 저지른 묻지마 범죄의 배경을 확인하기 위해 프로파일러 3명을 투입해 구체적인 범행 동기와 사건 경위를 조사 중입니다.</p><p>체포 당시 다량의 약물을 갖고 있던 A 씨는 경찰 조사에서 "약물을 복용했다"는 취지로 진술하기도 했는데, 마약류 간이시약 검사에서는 음성 반응이 나온 것으로 파악됐습니다.</p><p>[앵커]</p><p>피의자가 범행을 벌이기 불과 일주일 전에 경찰 조사를 받기도 했다고요?</p><p>[기자]</p><p>네, 맞습니다.</p><p>우선 피의자 A 씨는 어제 오후 1시 40분쯤 인천 구월동의 한 대형 상가건물에서 마구잡이로 흉기를 휘둘러 일면식 없는 시민들을 살해하려 한 혐의를 받는데요.</p><p>피해자 9명 중 심정지 상태로 병원으로 이송된 20대 여성 B 씨는 응급수술을 받고 고비는 넘겼지만, 아직까지 의식을 되찾지 못하고 있는 것으로 파악됐습니다.</p><p>이번 흉기난동 부상자 8명 가운데 6명은 여성입니다.</p><p>목격자 사이에서는 A 씨가, 시민들이 제지하자 여자화장실 쪽으로 이동했다며 주로 여성을 공격 대상으로 삼은 것 같다는 증언이 나오기도 했는데요.</p><p>직접 들어보시죠.</p><p>&lt;강병훈 / 목격자&gt; "남자들은 (범행이) 안 될 거 같으니깐 위로 갑자기 뛰어 올라가더라고요. 3층으로. 주차장 라인인데. 거기에 CGV에서 영화보고 내려오신 여성분이 계셨는데 그분도 찔리셔가지고…"</p><p>살인미수죄로 전자발찌를 차고 있던 A 씨는 1인 시위를 하는 과정에서 흉기를 소지한 죄로 입건돼 지난 6일 계양경찰서에서 조사를 받은 것으로 파악됐는데요.</p><p>한 병원에서 무좀 치료를 받은 뒤 증상이 나아지지 않는 데 불만을 품고 해당 병원 앞에서 1인 시위를 벌인 건데, 푯말에 구멍을 뚫기 위함이었지 사람을 해코지할 목적은 아니었다고 진술한 것으로 전해졌습니다.</p><p>지금까지 인천경찰청에서 연합뉴스TV 한웅희입니다.</p><p>[현장연결 이상혁]</p><p>연합뉴스TV 기사문의 및 제보 : 카톡/라인 jebo23</p><p>한웅희(hlight@yna.co.kr)</p>
      `,
    ],
    [
      `연합뉴스TV`,
      `김지용 "정치검사 1호 윤석열"…범여권도 청문회서 날선 질의`,
      `05:16`,
      `37분 전`,
      `정치`,
      `
        <p>[앵커]</p><p>오늘 김지용 중수청장 후보자에 대한 인사청문회가 열렸는데요.</p><p>야권뿐만 아니라, 후보자의 과거 수사 과정 및 검찰개혁 반대 이력을 두고 여권의 질책이 유독 매섭습니다.</p><p>자세한 내용 국회 연결해 들어보겠습니다.</p><p>장한별 기자.</p><p>[기자]</p><p>네, 국회입니다.</p><p>김지용 중수청장 후보자에 대한 국회 인사청문회가 후보자 지명 38일 만에 열렸는데요.</p><p>앞서 여권 강경파를 중심으로 청문회 전부터 김 후보자에 대한 비판이 쏟아진 가운데, 오늘 범여권 의원들은 김 후보자의 '친윤' 이력 등을 거론하며 검증의 날을 세웠습니다.</p><p>민주당 윤건영 의원은 검찰개혁 취지에 동의하는지, 이를 강력히 추진할 의지가 있는지 거듭 질의하는 한편, 과거 김 후보자가 이른바 '정치검찰의 한동훈 비호 사건'에 동참했다는 의혹도 재차 제시했습니다.</p><p>같은 당 이광희 의원은 과거 김 후보자가 윤석열 당시 검찰총장의 직무 배제 처분에 대해 반대 의사를 밝힌 경위를 따져 물었는데요.</p><p>이에 대해 김 후보자는 당시 당사자에게 소명 절차 없이 직무 배제 명령을 내리는 것이 맞는지 의문점을 가졌다고 설명했습니다.</p><p>다만, 자신에 대한 '친윤검사' 프레임에는 선을 긋는 태도를 보였는데, 관련 내용 들어보시겠습니다.</p><p>&lt;박덕흠 / 국회 행안위원(국민의힘)&gt; "그럼 검찰에서 정치검사 1호를 뽑는다면 누굴 뽑겠습니까?"</p><p>&lt;김지용 / 중대범죄수사청장 후보자&gt; "제가 생각하기엔 윤석열 전 (검찰)총장이 안 좋은 영향 끼친 데는 제일 첫 번째일 것 같습니다."</p><p>국민의힘 의원들은 검찰 수사권 폐지로 치안 공백과 사회적 약자 피해 우려가 커졌다면서, 검찰개혁의 맹점을 파고들었는데요.</p><p>특히 김 후보자 임명에 강력 반대한 추미애 경기지사 등을 거론하며, 여권의 내홍을 고리 삼아 내부 갈등을 부각하는 모습입니다.</p><p>김 후보자는 추 지사 등이 자신을 '친윤검사'로 몰아간 것에 대해 "모욕적이라고 생각한다"면서도 "중수청장이라는 자리의 무게감과 중요성 때문에 하신 말씀이라 생각"한다고 덧붙였습니다.</p><p>[앵커]</p><p>민주당은 또다시 신천지 논란으로 골머리를 앓고 있죠.</p><p>지도부는 후속 대응에 고민이 깊은 모습이라고요?</p><p>[기자]</p><p>그렇습니다, 전당대회 내홍 불씨 중 하나였던 '신천지 공방'이 다시 모습을 드러냈습니다.</p><p>최근 민주당 지도부 비공개회의에서 신천지 집단 가입 정황이 보고된 사실이 어제 알려진 데 이어, 김민석 대표도 오늘 이를 직접 확인했는데요.</p><p>다만 내부 갈등 우려가 크다 보니, 지도부는 후속 대응 역시 국감 이후로 미루는 등 신중을 기하고 있습니다.</p><p>관련 발언 들어보시겠습니다.</p><p>&lt;김민석 / 더불어민주당 대표(유튜브 '민주당티비')&gt; "상당한 정도의 집단적 가입이 있다는 것은 확인됐고 그 외에 상당히 의미 있는 증언들도 축적했고…민감한 문제이니만치 매우 신중하고 조심스럽게 하겠습니다."</p><p>전당대회 당시 신천지 공세에 반발해 온 친청계는 곧장 들썩였습니다.</p><p>정청래 의원은 ”반명·분열주의·신천지 3자 비밀연합이 허위 주장이었다면 책임질 사람은 책임져야 할 것”이라며 "잡티, 꼼수 없이 있는 그대로 밝히자"고 목소리를 높였습니다.</p><p>친청계 한민수 최고위원은 "신천지의 조직적 투표는 확인하지 못했음에도 의혹만 들추고 있다"며 "분란의 내막을 제대로 밝힐 수 없으면 사과부터 하는 것이 도리"라고 덧붙이는 등 불편한 심기를 감추지 않았습니다.</p><p>[앵커]</p><p>오늘도 여야의 안보 공방이 이어지고 있는 모습인데요.</p><p>[기자]</p><p>네, 그렇습니다.</p><p>비무장지대, DMZ 지뢰 폭발 사고와 최근 한미동맹 이상 기류 등 안보 이슈를 놓고 여야의 신경전이 이어지고 있는데요.</p><p>오늘 오전 기자회견을 연 국민의힘 정점식 원내대표는 특히 정동영 통일부 장관을 최근 한미 동맹 이상설의 원인으로 꼽으며, 이 대통령이 즉각 정 장관을 경질해야 한다고 촉구했습니다.</p><p>관련 내용 들어보시겠습니다.</p><p>&lt;정점식 / 국민의힘 원내대표&gt; "북한은 지뢰 매설뿐만 아니라 연일 미사일을 날리며 도발 중이고…심지어 통일부 장관의 본분도 잊은 채 북한의 두 국가론을 추종합니다. 이와 같은 행태가 종북이 아니면 무엇입니까?"</p><p>국민의힘은 현 정부의 외교안보라인이 흔들리고 있다며 총공세에 나선 모습인데요.</p><p>다만 민주당은 "한미 양국은 정보 교류와 속도면에서 가장 신속하다"며, 호혜적인 협력 방향이 이어질 것이라 강조하며 방어전에 나섰습니다.</p><p>한편, 오늘은 복지위, 농해수위, 교육위 등 5개 상임위에서 국정감사가 열렸는데요.</p><p>특히 복지위에서는 최근 증시 급락장과 관련해 국민연금의 투자비중 조정, 즉 '리밸런싱' 유예 결정을 두고 여야 공방이 펼쳐졌습니다.</p><p>아울러 이날 열린 국방위 전체회의에서는 '군사분계선 이남 지역에서의 북한 지뢰 도발 규탄 결의안'이 여당 주도로 채택됐습니다.</p><p>국민의힘은 '군 책임 규명' 내용을 포함해야 한다고 주장했으나 여야 이견이 좁혀지지 않았고, 결국 국민의힘 위원들이 퇴장한 상태에서 해당 내용은 제외한 채 의결됐습니다.</p><p>연합뉴스TV 장한별입니다.</p><p>[현장연결 김민서]</p><p>[영상편집 박은준]</p><p>연합뉴스TV 기사문의 및 제보 : 카톡/라인 jebo23</p><p>장한별(good_star@yna.co.kr)</p>
      `,
    ],
    [
      `연합뉴스TV`,
      `[현장연결] 靑, 신임 대통령비서실장에 임광현 현 국세청장 임명`,
      `04:46`,
      `46분 전`,
    ],
    [
      `연합뉴스TV`,
      `특검, 중앙선관위 등 5곳 압수수색…투표소 물품세트 유착 의혹`,
      `00:44`,
      `47분 전`,
    ],
    [
      `연합뉴스TV`,
      `[속보] '공천 헌금' 강선우 1심 징역 2년 6개월 선고`,
      `00:48`,
      `48분 전`,
    ],
  ],
  [
    [
      `채널A NEWS`,
      `인천 흉기 난동 신고부터 검거까지 ‘공포의 7분’`,
      `07:18`,
      `54분 전`,
    ],
    [
      `채널A NEWS`,
      `차량·사람 덮치는 패러글라이딩…“비상착륙?” 주민들 불안`,
      `06:00`,
      `59분 전`,
    ],
    [
      `채널A NEWS`,
      `[날씨]한낮에도 찬바람 ‘서울 한낮 20도’`,
      `01:05`,
      `1시간 전`,
    ],
    [
      `채널A NEWS`,
      `한동훈, 주유엔대사에 “프로 자리에 아마추어”`,
      `10:42`,
      `1시간 전`,
    ],
    [
      `채널A NEWS`,
      `흉기 난동에 8명 중경상…프로파일러 3명 투입`,
      `01:50`,
      `1시간 전`,
    ],
  ],
];

const category_news = [
  [],
  [
    [
      `사회1`,
      `한국 의술 배우던 우즈벡 의사…비행기서 한국인 생명 구했다 [잇슈#태그]`,
      `01:06`,
      `KBS NEWS 24`,
      `5분 전`,
      `<p> 한국행 비행기에서 쇼크 증세로 생명이 위태로운 여성을 우즈베키스탄 의사가 살렸다는 사연이 전해지면서 감동을 주고 있습니다.</p><p>최근 한 SNS에는 우즈베키스탄발 한국행 비행기에서 벌어진 긴박한 상황을 목격했다는 글이 올라왔습니다.</p><p>당시 한국계로 추정되는 여성 승객이 갑자기 쇼크 증세를 보였는데요.</p><p>가까운 자리에 앉아 있던 우즈베키스탄인 의사가 망설임 없이 응급처치에 나섰습니다.</p><p>영상 속 의사는 허리를 깊이 숙인 채 여성의 상태를 살피며 응급처치에 집중하고 있는데요.</p><p>여성에게 간헐적으로 산소를 공급하고 주사를 투여하는 등 상태를 살핀 끝에, 다행히 여성은 한국까지 무사히 도착한 것으로 전해졌습니다.</p><p>알고 보니 이 의사는 한국의 의술을 배우기 위해 8년째 우즈베키스탄과 한국을 오가고 있었다고 하는데요.</p><p>긴박한 순간에도 환자를 먼저 생각했던 의사.그의 따뜻한 마음과 용기 있는 행동이 국경을 넘어 잔잔한 감동을 전하고 있습니다.</p><p>(구성: 김수란 작가, 영상편집: 박준서, 영상출처: 스레드 'cotonkennel_bonco',인스타그램 'kamilovkhasan', 음성: AI생성)</p>`,
    ],
    [
      `사회2`,
      `햅쌀밥부터 농경문화 체험까지…이천쌀문화축제`,
      `01:50`,
      `연합뉴스TV`,
      `14분 전`,
      `<p>[앵커]</p><p>풍요로운 가을, 갓 지은 햅쌀밥을 맛볼 수 있는 축제가 경기도 이천에서 열렸습니다.</p><p>다양한 전통놀이와 공연도 즐길 수 있어서 많은 방문객이 찾고 있는데요.</p><p>현장에 나가 있는 뉴스캐스터 연결해 보겠습니다.</p><p>함현지 캐스터.</p><p>[캐스터]</p><p>저는 지금 제25회 이천쌀문화축제가 열리고 있는 이천시 복하천 수변공원에 나와 있습니다.</p><p>경기도 이천하면 역시 쌀을 빼놓을 수 없는데요.</p><p>이천 쌀을 직접 맛볼 수 있고 다양한 행사나 공연도 열리고 있어서 축제장은 방문객으로 북적이고 있습니다.</p><p>개막일을 맞아 축제의 시작을 알리는 '임금님 진상 행렬' 행사가 열렸는데요.</p><p>설봉온천에서 출발해 이곳 복하천 수변공원까지, 조선시대 왕실에 이천 쌀을 진상하던 모습을 재현했습니다.</p><p>축제 대표 프로그램인 '가마솥밥 이천명 이천원' 행사는 관람객들의 입맛을 사로잡고 있는데요.</p><p>대형 가마솥에서 갓 지어낸 이천 햅쌀밥을 단돈 2천 원에 맛볼 수 있어 인기를 끌고 있습니다.</p><p>각종 놀이마당과 공연 등 다양한 볼거리도 준비돼 있습니다.</p><p>방문객이 긴 줄을 만들어 알록달록한 떡을 길게 뽑는 '600m 무지개 가래떡 만들기' 행사도 매일 열리고요.</p><p>전통 짚풀 공예, 윷놀이 등 농경문화 체험장과 낮 시간대에는 '조선풍년운동회'도 참여할 수 있습니다.</p><p>관람객 모두가 즐길 수 있는 '조선 주막 클럽' 행사는 디제이 공연과 춤, 강강술래 등이 열려 전통놀이와 현대적인 공연을 모두 즐길 수 있습니다.</p><p>이번 축제는 오늘부터 18일, 일요일까지 닷새간 이어집니다.</p><p>깊어져 가는 가을, 맛있는 이천 쌀과 함께 다채로운 체험을 즐기며 가을 추억을 만들어 보셔도 좋겠습니다.</p><p>지금까지 이천쌀문화축제 현장에서 연합뉴스TV 함현지입니다.</p><p>[현장연결 이대형]</p><p>#쌀 #가을 #이천시 #이천쌀문화축제</p><p>연합뉴스TV 기사문의 및 제보 : 카톡/라인 jebo23</p><p>노수미(luxiumei88@yna.co.kr)</p>`,
    ],
    [
      `사회3`,
      `[속보] '공천 헌금' 강선우 1심 징역 2년 6개월 선고`,
      `01:56`,
      `연합뉴스TV`,
      `16분 전`,
      `<p>[앵커]</p><p>이른바 '공천헌금 수수' 혐의로 재판에 넘겨진 강선우 무소속 의원이 1심에서 징역 2년 6개월을 선고받았습니다.</p><p>증거인멸 우려로 보석도 취소돼 법정구속됐습니다.</p><p>법원 연결해 보겠습니다.</p><p>박지운 기자!</p><p>[기자]</p><p>네, 조금 전 서울중앙지법은 정치자금법 위반 등 혐의로 기소된 강선우 의원에게 징역 2년 6개월에 추징금 1억 원을 선고했는데요.</p><p>같이 재판에 넘겨진 김경 서울시의원에게는 징역 1년을 선고했습니다.</p><p>앞서 보석으로 풀려났던 두 사람은 증거인멸 등 우려로 보석이 취소돼 법정구속됐습니다.</p><p>강 의원은 김경 전 서울시의원으로부터 공천을 대가로 쇼핑백에 든 현금 1억 원을 건네받은 혐의로 재판에 넘겨졌습니다.</p><p>현 공소청, 전 검찰은 제공된 돈이 강 의원 전세 계약금으로 쓰인 걸로 봤는데요.</p><p>1심 재판부는 서울시당 공천과 관련해 강선우 의원이 정치자금법 입법 취지를 심각하게 훼손해 엄중한 처벌이 필요하다고 판시했습니다.</p><p>한편, 쇼핑백을 직접 받은 인물로 지목된 강 의원 보좌관 남 모 씨에게는 징역 8개월에 집행유예 2년이 선고됐습니다.</p><p>재판 과정에서 김경 전 시의원과 남 모 씨는 범행 사실을 시인하고 재판부에 선처를 구했는데요.</p><p>강선우 의원은 결코 돈을 받은 사실이 없다며 혐의를 전면 부인해 왔습니다.</p><p>최후진술에서도 강 의원은 "보좌관의 일탈행위로 물의를 일으키게 돼 죄송하다"면서도 "어떤 돈도 받은 적 없다"고 말하며 눈물을 삼켰는데요.</p><p>하지만 1심 재판부는 "미필적으로나마 쇼핑백 안에 현금 1억 있었다는 사실을 알고 있었다고 봄이 타당하다"며 유죄를 선고했습니다.</p><p>한편, 강 의원과 김 전 시의원은 1억 3천만 원 쪼개기 후원 혐의로도 기소돼 있는데요.</p><p>해당 사건은 이번 달 말 첫 공판을 앞두고 있습니다.</p><p>지금까지 서울중앙지법에서 전해드렸습니다.</p><p>연합뉴스TV 기사문의 및 제보 : 카톡/라인 jebo23</p><p>박지운(zwoonie@yna.co.kr)</p>`,
    ],
    [
      `사회4`,
      `'인천 흉기난동' 피의자 본격 조사…프로파일러 투입`,
      `01:48`,
      `연합뉴스TV`,
      `16분 전`,
    ],
    [
      `사회5`,
      `[뉴스핫픽] 중국 곳곳에 지드래곤?…한한령 변화 신호탄 될까`,
      `02:33`,
      `연합뉴스TV`,
      `19분 전`,
    ],
  ],
  [
    [
      `경제1`,
      `HMM(011200) - LNG 프로젝트 보다 운임 상승 효과 집중`,
      `02:17`,
      `한국경제TV`,
      `4분 전`,
      ``,
    ],
    [
      `경제2`,
      `트럼프 '중간선거 앞두고 유가 인상 시도'`,
      `04:14`,
      `한국경제TV`,
      `6분 전`,
      ``,
    ],
    [
      `경제3`,
      `기술주 포지셔닝 역사적 천장`,
      `05:15`,
      `한국경제TV`,
      `8분 전`,
      ``,
    ],
    [
      `경제4`,
      `IMF '선진국 재정적자, 코로나 이후 최대'`,
      `05:45`,
      `한국경제TV`,
      `14분 전`,
    ],
    [
      `경제5`,
      `KB증권 삼전닉스 실적이 W자 반등 견인 전망`,
      `06:45`,
      `SBS Biz`,
      `15분 전`,
    ],
  ],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
];

category_news[0] = structuredClone([
  ...category_news[1],
  ...category_news[2],
]).sort((a, b) => {
  return a[1].localeCompare(b[1]);
});

// console.log(category_news);
